{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "name": "dense_1/kernel", "shape": [6, 24]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [24]}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "name": "dense_2/kernel", "shape": [24, 48]}, {"dtype": "float32", "name": "dense_2/bias", "shape": [48]}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "name": "dense_3/kernel", "shape": [48, 96]}, {"dtype": "float32", "name": "dense_3/bias", "shape": [96]}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "name": "dense_4/kernel", "shape": [96, 192]}, {"dtype": "float32", "name": "dense_4/bias", "shape": [192]}]}, {"paths": ["group5-shard1of1"], "weights": [{"dtype": "float32", "name": "dense_5/kernel", "shape": [192, 2]}, {"dtype": "float32", "name": "dense_5/bias", "shape": [2]}]}], "modelTopology": {"keras_version": "2.1.6", "training_config": {"metrics": ["accuracy"], "sample_weight_mode": null, "optimizer_config": {"config": {"lr": 0.0010000000474974513, "decay": 0.0, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "epsilon": 1e-07, "amsgrad": false}, "class_name": "Adam"}, "loss": "categorical_crossentropy", "loss_weights": null}, "backend": "tensorflow", "model_config": {"config": [{"config": {"dtype": "float32", "units": 24, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "batch_input_shape": [null, 6], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "activation": "relu", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_2", "units": 48, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "activation": "relu", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_3", "units": 96, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "activation": "relu", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_4", "units": 192, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "activation": "relu", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dense_5", "units": 2, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "use_bias": true, "activation": "softmax", "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}}}